Sophrosync/docs/security/jmeter-report/statistics.json
{
  "POST /api/notes" : {
    "transaction" : "POST /api/notes",
    "sampleCount" : 50,
    "errorCount" : 49,
    "errorPct" : 98.0,
    "meanResTime" : 8.379999999999997,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 340.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 340.0,
    "throughput" : 11.21830827911151,
    "receivedKBytesPerSec" : 2.8786354330267,
    "sentKBytesPerSec" : 18.054464886695087
  },
  "GET /api/clients (authorized)" : {
    "transaction" : "GET /api/clients (authorized)",
    "sampleCount" : 200,
    "errorCount" : 197,
    "errorPct" : 98.5,
    "meanResTime" : 2.020000000000002,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 104.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 9.0,
    "throughput" : 21.19317579739324,
    "receivedKBytesPerSec" : 5.290946705785737,
    "sentKBytesPerSec" : 30.382404365794216
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 750,
    "errorCount" : 746,
    "errorPct" : 99.46667,
    "meanResTime" : 3.055999999999996,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 340.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 39.0,
    "throughput" : 79.47440924022465,
    "receivedKBytesPerSec" : 19.74266434645544,
    "sentKBytesPerSec" : 45.273507867966515
  },
  "GET /api/clients (no auth â€” expect 401 or 429)" : {
    "transaction" : "GET /api/clients (no auth â€” expect 401 or 429)",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 2.9379999999999966,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 39.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 39.0,
    "throughput" : 536.4806866952789,
    "receivedKBytesPerSec" : 132.5652159334764,
    "sentKBytesPerSec" : 64.44055123390558
  }
}